### Terraform Plan - `dev` Environment

<details>
<summary>Show Plan</summary>

```terraform
random_string.kv_suffix: Refreshing state... [id=7j51clw8]
random_string.appgw_suffix: Refreshing state... [id=u02liakq]
random_string.storage_suffix: Refreshing state... [id=b5xxtm3i]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01NjQwMDBmNi05NDQ3LTQ2OTktYjg3ZS1iZWIzZDA1MjliYzQ7b2JqZWN0SWQ9MTg3ZjEwMTgtZWVhNi00YWU4LWJiMWItOGNjN2ZlYzFkNWM5O3N1YnNjcmlwdGlvbklkPWRjMjJkNmQ4LTA0OTUtNDY1My1hNjliLWVkZmUxNjg0MGY4ZTt0ZW5hbnRJZD02MWE4NzQ2ZS00MjRkLTQxMDUtYTA1NC1iMzg1NzNkNmU1NGE=]
azurerm_user_assigned_identity.nsg_flow_logs: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/nsg-flow-logs-identity]
azurerm_log_analytics_workspace.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.OperationalInsights/workspaces/chatops-loganalytics]
azurerm_network_watcher.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkWatchers/chatops-network-watcher]
azurerm_user_assigned_identity.appgw: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/chatops-appgw-identity]
azurerm_public_ip.appgw: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/publicIPAddresses/chatops-appgw-pip]
azurerm_monitor_action_group.security_alerts: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/security-alerts]
azurerm_monitor_action_group.ops_alerts: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts]
azurerm_service_plan.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan]
azurerm_network_security_group.app_nsg: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg]
azurerm_storage_account.nsg_flow_logs: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i]
azurerm_network_security_group.gateway_nsg: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg]
azurerm_virtual_network.chatops_vnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet]
azurerm_web_application_firewall_policy.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/chatops-waf-policy]
azurerm_network_security_rule.allow_internet_outbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/AllowInternetOutbound]
azurerm_network_security_rule.allow_gateway_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/AllowGatewayInbound]
azurerm_network_security_rule.deny_all_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/DenyAllInbound]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_failed_auth: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-failed-authentication-alert]
azurerm_application_insights.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/components/chatops-appinsights]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_access_anomaly: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-secret-access-anomaly-alert]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_expiration: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-secret-expiration-alert]
azurerm_subnet.gateway_subnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/gateway-subnet]
azurerm_subnet.app_subnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet]
azurerm_network_security_rule.allow_gateway_manager: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg/securityRules/AllowGatewayManager]
azurerm_network_security_rule.allow_https_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg/securityRules/AllowHTTPSInbound]
azurerm_subnet_network_security_group_association.app_nsg_assoc: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet]
azurerm_key_vault.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8]
azurerm_subnet_network_security_group_association.gateway_nsg_assoc: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/gateway-subnet]
azurerm_application_insights_standard_web_test.chatops_australiaeast: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-australiaeast]
azurerm_application_insights_standard_web_test.chatops_northeurope: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-northeurope]
azurerm_application_insights_standard_web_test.chatops_southeastasia: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-southeastasia]
azurerm_monitor_scheduled_query_rules_alert_v2.slow_response_time: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/slow-response-time]
azurerm_application_insights_standard_web_test.chatops_westus: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-westus]
azurerm_monitor_scheduled_query_rules_alert_v2.availability_test_failure: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/availability-test-failure]
azurerm_application_insights_standard_web_test.chatops_eastus: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-eastus]
azurerm_monitor_scheduled_query_rules_alert_v2.high_exception_rate: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/high-exception-rate]
azurerm_monitor_scheduled_query_rules_alert_v2.failed_dependency: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/failed-dependency]
azurerm_key_vault_secret.github_webhook_secret: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-webhook-secret/c38ad3dabaa641a6bb95509192603d5b]
azurerm_key_vault_secret.bot_app_password: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/bot-app-password/9eca0b2ba5184787a66a774bd0f26afa]
azurerm_key_vault_secret.entra_client_secret: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/entra-client-secret/e35620c27c2246448225265dc042680b]
azurerm_key_vault_secret.bot_app_id: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/bot-app-id/ddcab9583fe546a58b29ee30ace31f78]
azurerm_key_vault_secret.github_app_id: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-app-id/d72bc82dcf674d5f855557e87753f33b]
azurerm_role_assignment.appgw_kv_secrets_user: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8/providers/Microsoft.Authorization/roleAssignments/52b05056-9fb9-81a4-57ff-882c076fca65]
azurerm_monitor_diagnostic_setting.kv_diagnostics: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8|kv-diagnostics]
azurerm_key_vault_secret.appinsights_connection_string: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/appinsights-connection-string/646c2e5acd6c452f85260e74591cc5fb]
azurerm_key_vault_secret.github_app_private_key: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-app-private-key/0c059973e36441789f8c2c66d36f3572]
azurerm_linux_web_app.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service]
azurerm_role_assignment.flow_logs_storage: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i/providers/Microsoft.Authorization/roleAssignments/65c90aa2-911a-b1ce-443f-09efb50ec550]
azurerm_role_assignment.terraform_storage_access: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i/providers/Microsoft.Authorization/roleAssignments/2e56668e-b83a-d1b7-8a27-6c15b56ca283]
azurerm_key_vault_certificate.appgw_ssl: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/certificates/appgw-ssl-cert/c7a3b8bf8f664306aa21b7196e0eee2e]
azurerm_application_gateway.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGateways/chatops-appgw]
azurerm_monitor_diagnostic_setting.appgw_diagnostics: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGateways/chatops-appgw|appgw-diagnostics]
azurerm_app_service_virtual_network_swift_connection.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service/config/virtualNetwork]
azurerm_role_assignment.kv_secrets_user_app_service: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8/providers/Microsoft.Authorization/roleAssignments/b78214a8-1f48-f6e0-a32d-0748f9893376]
azurerm_monitor_diagnostic_setting.app_service: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service|app-service-diagnostics]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault_secret.redis_access_key will be created
  + resource "azurerm_key_vault_secret" "redis_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
      + name                    = "redis-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "AccessKey"
          + "Service"     = "Redis"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_host will be created
  + resource "azurerm_key_vault_secret" "redis_host" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
      + name                    = "redis-host"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "ConnectionString"
          + "Service"     = "Redis"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_port will be created
  + resource "azurerm_key_vault_secret" "redis_port" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
      + name                    = "redis-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "SecretType"  = "Configuration"
          + "Service"     = "Redis"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.chatops will be updated in-place
  ~ resource "azurerm_linux_web_app" "chatops" {
      ~ app_settings                                   = {
          + "REDIS_HOST"                                 = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=redis-host)"
          + "REDIS_PASSWORD"                             = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=redis-access-key)"
          + "REDIS_PORT"                                 = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=redis-port)"
          + "REDIS_TLS"                                  = "true"
            # (7 unchanged elements hidden)
        }
        id                                             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service"
        name                                           = "chatops-app-service"
        tags                                           = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
        }
      - virtual_network_subnet_id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet" -> null
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.redis will be created
  + resource "azurerm_monitor_diagnostic_setting" "redis" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.OperationalInsights/workspaces/chatops-loganalytics"
      + name                           = "redis-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ConnectedClientList"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_metric_alert.redis_connection_errors will be created
  + resource "azurerm_monitor_metric_alert" "redis_connection_errors" {
      + auto_mitigate            = true
      + description              = "Alert when more than 5 connection errors occur within 5 minutes, indicating potential connectivity issues."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "redis-connection-errors"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "errors"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 5

          + dimension {
              + name     = "ErrorType"
              + operator = "Include"
              + values   = [
                  + "ConnectionError",
                ]
            }
        }
    }

  # azurerm_monitor_metric_alert.redis_high_cache_miss_rate will be created
  + resource "azurerm_monitor_metric_alert" "redis_high_cache_miss_rate" {
      + auto_mitigate            = true
      + description              = "Alert when cache miss rate exceeds 50% for 10 minutes, indicating inefficient caching patterns."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "redis-high-cache-miss-rate"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cachemissrate"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # azurerm_monitor_metric_alert.redis_high_memory_usage will be created
  + resource "azurerm_monitor_metric_alert" "redis_high_memory_usage" {
      + auto_mitigate            = true
      + description              = "Alert when Redis memory usage exceeds 90%, indicating potential memory pressure."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "redis-high-memory-usage"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "usedmemorypercentage"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 90
        }
    }

  # azurerm_monitor_metric_alert.redis_high_server_load will be created
  + resource "azurerm_monitor_metric_alert" "redis_high_server_load" {
      + auto_mitigate            = true
      + description              = "Alert when Redis server load exceeds 90% for 5 minutes, indicating potential performance issues."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "redis-high-server-load"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "serverLoad"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 90
        }
    }

  # azurerm_redis_cache.chatops will be created
  + resource "azurerm_redis_cache" "chatops" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + minimum_tls_version           = "1.2"
      + name                          = (known after apply)
      + non_ssl_port_enabled          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "rg-chatops-dev"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = (known after apply)
      + tags                          = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-Team"
          + "Purpose"     = "DistributedCache"
        }

      + redis_configuration {
          + aof_backup_enabled                     = false
          + authentication_enabled                 = (known after apply)
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "allkeys-lru"
          + maxmemory_reserved                     = (known after apply)
          + notify_keyspace_events                 = "KEx"
          + rdb_backup_enabled                     = true
          + rdb_backup_frequency                   = 15
          + rdb_backup_max_snapshot_count          = 1
          + rdb_storage_connection_string          = (sensitive value)
        }
    }

  # azurerm_storage_account.nsg_flow_logs will be updated in-place
  ~ resource "azurerm_storage_account" "nsg_flow_logs" {
      ~ allow_nested_items_to_be_public   = false -> true
        id                                = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i"
        name                              = "chatopsnsgflowb5xxtm3i"
        tags                              = {
            "Application" = "ChatOps"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Purpose"     = "NSG Flow Logs"
        }
        # (40 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.redis_backup will be created
  + resource "azurerm_storage_account" "redis_backup" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-chatops-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Purpose"     = "RedisPersistence"
        }
    }

  # azurerm_subnet.app_subnet will be updated in-place
  ~ resource "azurerm_subnet" "app_subnet" {
        id                                             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet"
        name                                           = "app-subnet"
        # (11 unchanged attributes hidden)

      ~ delegation {
            name = "app-service-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.App/environments"
            }
        }
    }

  # azurerm_subnet.redis_subnet will be created
  + resource "azurerm_subnet" "redis_subnet" {
      + address_prefixes                               = [
          + "10.0.4.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "chatops-redis-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-chatops-dev"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "chatops-vnet"
    }

  # random_string.redis_suffix will be created
  + resource "random_string" "redis_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 12 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + redis_access_key_secret_id                   = (known after apply)
  + redis_cache_hostname                         = (known after apply)
  + redis_cache_id                               = (known after apply)
  + redis_cache_name                             = (known after apply)
  + redis_cache_primary_access_key               = (sensitive value)
  + redis_cache_ssl_port                         = (known after apply)
  + redis_host_secret_id                         = (known after apply)
  + redis_port_secret_id                         = (known after apply)
  + redis_subnet_id                              = (known after apply)

Warning: Argument is deprecated

  with azurerm_redis_cache.chatops,
  on redis.tf line 72, in resource "azurerm_redis_cache" "chatops":
  72:   enable_non_ssl_port = false

`enable_non_ssl_port` will be removed in favour of the property
`non_ssl_port_enabled` in version 4.0 of the AzureRM Provider.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @deividfoggi, Action: `pull_request`, Workflow: `Infrastructure - PR Validation`*